45-deployment/tiny-cms/app/controllers/pages_controller.rb

  def show
    if params[:id].to_i == 0
      @page = Page.find_by_slug(params[:id])
    else
      @page = Page.find(params[:id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."slug" = $1 LIMIT $2  [["slug", "contact"], ["LIMIT", 1]]
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @page = Page.new
    @page.slug = params[:page][:slug]
    @page.title = params[:page][:title]
    @page.content = params[:page][:content]

    if @page.save
---
INSERT INTO "pages" ("slug", "title", "content") VALUES ($1, $2, $3) RETURNING "id"  [["slug", "seany"], ["title", "pie"], ["content", "pie"]]

  def update
    @page = Page.find(params[:id])
    @page.slug = params[:page][:slug]
    @page.title = params[:page][:title]
    @page.content = params[:page][:content]

    if @page.save
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "pages" SET "title" = $1, "content" = $2 WHERE "pages"."id" = $3  [["title", "piet"], ["content", "piec"], ["id", 3]]

  def destroy
    flash.notice = 'Page deleted'
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "pages" WHERE "pages"."id" = $1  [["id", 1]]