45-deployment/tiny-cms/app/views/pages/index.html.erb

<ul>
  <% Page.all.each do |page| %>
---
SELECT "pages".* FROM "pages"